
import React from 'react';
import Link from 'next/link';
export default function learn() {
  return (
    <div className="max-w-7xl mx-auto p-4">
    
      <h2 className="text-4xl font-semibold mb-4">Design basics</h2>
      <p className="text-gray-700 mb-8">เริ่มต้นการออกแบบโดยการเรียนรู้พื้นฐาน</p>
      <div className="bg-white shadow-md rounded-lg p-6 border border-gray-300">
        <h3 className="text-2xl font-semibold mb-2">Getting started in design ?</h3>
          <img src="https://cdn.sanity.io/images/599r6htc/localized/80e3e2472a0120ed87663cf758f1cbfe9be2be47-2400x1256.png?q=75&fit=max&auto=format&dpr=2" alt="Design basics" className=" h-auto w-full max-w-3xl mx-auto p-5 " />
         
          <p className="text-gray-600 mb-4">หากคุณเคยต้องการที่จะประกอบอาชีพด้านการออกแบบ เรียนรู้กระบวนการออกแบบอย่างเจาะลึก หรือเพียงต้องการปรับปรุงความสัมพันธ์ในชีวิตของคุณกับนักออกแบบ คุณมาถูกที่แล้ว</p>
          <p className="text-gray-600 mb-4">ไม่ว่าคุณจะอยากเรียนรู้เกี่ยวกับการออกแบบทำไม ที่ Figma เราต้องการทำให้มันง่ายที่สุดเท่าที่จะเป็นไปได้สำหรับคุณ ดังนั้นเราจึงสร้างโปรแกรม Learn Design นี้ขึ้นมา สิ่งนี้ไม่ได้เกิดขึ้นเพียงเพื่อช่วยให้คุณเรียนรู้การใช้เครื่องมือที่เราสร้างขึ้น แต่เพื่อเรียนรู้พื้นฐานของการออกแบบและแนวคิดเบื้องหลังผลิตภัณฑ์ดิจิทัลที่ใหญ่ที่สุดที่มีอยู่ในปัจจุบัน</p>
          <p className="text-gray-600 mb-4">ณอาจต้องการใช้การออกแบบเพื่ออธิบาย เล่าเรื่องราว วางแผน แก้ไขปัญหา หรือทำให้บางสิ่งดูดี เหล่านี้คือเป้าหมายทั้งหมดที่คุณสามารถบรรลุได้ด้วยการออกแบบ บ่อยครั้งที่ผู้คนคิดว่าการออกแบบเป็นเรื่องเกี่ยวกับรูปลักษณ์ของสิ่งต่างๆ นั่นเป็นเพียงองค์ประกอบหนึ่งของการออกแบบ แต่เราจะมาดูกันว่ามีการออกแบบอะไรบ้างในส่วนนี้ สำหรับตอนนี้ เรามาดูส่วนที่เป็นภาพบางส่วนของการออกแบบกันดีกว่า</p>
          <p className="text-gray-600 mb-4">การออกแบบภาพ เช่น ป้ายโฆษณา หน้าจอแอพ โฆษณา Facebook หรือไอคอน เป็นองค์ประกอบของรูปทรงพื้นฐานเพื่อสร้างสิ่งที่ยิ่งใหญ่กว่า เส้น สี่เหลี่ยม วงกลม และสามเหลี่ยมถือเป็นการออกแบบส่วนใหญ่ นอกจากนี้ยังมีรูปภาพและข้อความ ซึ่งเราจะมาดูกันเร็วๆ นี้ แต่มาเริ่มกันที่ข้อมูลพื้นฐานกันดีกว่า</p>
          <p className="text-gray-600 mb-4">นี่คือหน้าจอจากแอพ Apple Music:</p>
          <img src="https://cdn.sanity.io/images/599r6htc/localized/d314fa3726639592ce8341802cfbf02d9488cb1b-1200x948.png?q=75&fit=max&auto=format&dpr=2" alt="Design basics" className=" h-auto w-full max-w-3xl mx-auto p-7  " />
          <p className="text-gray-600 mb-4">เป็นชุดของรูปร่าง รูปภาพ และข้อความที่จัดระเบียบเป็นองค์ประกอบ นักออกแบบที่สร้างสินค้าเหล่านี้ได้จัดเรียงสินค้าเหล่านี้โดยคำนึงถึงเป้าหมายบางประการ มีเป้าหมายทางธุรกิจของผลิตภัณฑ์อยู่เสมอ เช่น "ทำให้ลูกค้าเพิ่มเพลงลงในเพลย์ลิสต์ของตน" นักออกแบบยังมุ่งเน้นไปที่เป้าหมาย เช่น ความสามารถในการอ่าน — ความง่ายสำหรับคนส่วนใหญ่ในการอ่านข้อมูลบนหน้าจอ — และการใช้งาน — ความง่ายสำหรับคนส่วนใหญ่ในการดำเนินการตามที่ตั้งใจไว้ เช่น การค้นพบอัลบั้มใหม่ . เราจะดูเป้าหมายอื่นๆ อีกมากมายในช่วงที่เหลือของบทเรียนในหลักสูตรนี้</p>
          <img src="https://cdn.sanity.io/images/599r6htc/localized/5c433416f4c423e650383c7e14dacb34550f06c5-1000x792.png?q=75&fit=max&auto=format&dpr=2" alt="Design basics" className=" h-auto w-full max-w-3xl mx-auto p-7  " />
          <p className="text-gray-600 mb-4">ด้านล่างนี้คือไฟล์ของหน้าจอ Apple Music จากด้านบนพร้อมคอลเลกชั่นวัตถุและไวร์เฟรม เมื่อคุณเปิดกิจกรรมแล้ว ให้ลากองค์ประกอบอินเทอร์เฟซไปที่ด้านบนของรูปร่างในกรอบทางด้านขวา</p>
          <p className="text-gray-600 mb-4">หวังว่า ณ จุดนี้ คุณจะเข้าใจได้ดีขึ้นว่าสามารถสร้างแอปบนโทรศัพท์ด้วยองค์ประกอบพื้นฐานของเส้น สี่เหลี่ยม วงกลม และสามเหลี่ยมได้อย่างไร ดูแอปโปรดของคุณบนโทรศัพท์และพิจารณาส่วนประกอบต่างๆ ที่แอปเหล่านั้นสร้างขึ้น เช่นเดียวกับบนเว็บ หรือแม้แต่ป้ายโฆษณา นิตยสาร หนังสือ ส่วนใหญ่ประกอบด้วยรูปทรงพื้นฐานเหล่านี้ที่จัดเรียงเข้าด้วยกันเพื่อให้บรรลุเป้าหมายและดูสวยงามตา เมื่อคุณเรียนรู้การออกแบบ คุณจะได้เรียนรู้วิธีจัดเรียงออบเจ็กต์ต่างๆ ในเลย์เอาต์และอินเทอร์เฟซเพื่อให้บรรลุเป้าหมายของคุณ ตลอดจนทำความเข้าใจว่าทำไมและอย่างไรจึงจะบรรลุเป้าหมายของบริษัทหรือลูกค้าของคุณ</p>
          <p className="text-2xl font-semibold text-gray-600 mb-4">ทำไมต้องเรียนการออกแบบ?</p>
          <p className="text-gray-600 mb-4">การออกแบบเป็นสิ่งสำคัญ บริษัทที่ประสบความสำเร็จในการพลิกโฉมอุตสาหกรรมเก่าแก่จะมอบประสบการณ์ที่ดีกว่า โดยมักจะแก้ไขปัญหาเดียวกันไปพร้อมๆ กัน ตัวอย่างง่ายๆ: Uber และ Lyft กับรถแท็กซี่ บริการทั้งสองนี้มีแอปเพื่อเรียกรถไปยังสถานที่เฉพาะบนแผนที่ ในขณะที่แท็กซี่จำเป็นต้องติดธงหรือเรียกผ่านบริการจัดส่ง</p>
          <p className="text-gray-600 mb-4">ในขณะที่โลกทางกายภาพก้าวไปสู่ยุคดิจิทัลอย่างรวดเร็ว และสมาร์ทโฟนกำลังนำเทคโนโลยีไปไว้ในมือของคนนับพันล้าน บริษัทต่างๆ จึงมีความจำเป็นในการสร้างสรรค์สิ่งใหม่ๆ และตอนนี้กำลังแข่งขันกันด้วยพลังของประสบการณ์ของลูกค้า บทบาทของการออกแบบได้ย้ายจากสิ่งที่ดีไปสู่สิ่งที่ต้องมีไปสู่สิ่งที่สร้างความแตกต่าง เป็นผลให้นักออกแบบมีอิทธิพลมากขึ้น แต่มีนักออกแบบไม่เพียงพอที่จะตอบสนองความต้องการ</p>
          <p className="text-gray-600 mb-4">โดยเฉพาะอย่างยิ่งในการออกแบบผลิตภัณฑ์ที่บริษัทที่สร้างผลิตภัณฑ์ดิจิทัล ในช่วงไม่กี่ปีที่ผ่านมา บริษัทต่างๆ ได้ขยายองค์กรด้านการออกแบบของตนเนื่องจากพวกเขาเข้าใจว่าประสบการณ์ของผู้ใช้กำลังกลายเป็นตัวสร้างความแตกต่างที่สำคัญ ด้วยเหตุนี้ อัตราส่วนนักออกแบบต่อวิศวกรจึงมีการเปลี่ยนแปลงในหลายๆ บริษัท</p>
          <p className="text-gray-600 mb-4">นี่เป็นเพียงตัวอย่างบางส่วน:</p>
          <img src="https://cdn.sanity.io/images/599r6htc/localized/5c1854987b3e7a491ffc20b3877d09f658d67099-3036x1860.png?q=75&fit=max&auto=format&dpr=0.75" alt="Design basics" className=" h-auto w-full max-w-3xl mx-auto p-7  " />
          <p className="text-2xl font-semibold text-gray-600 mb-4">หลักสูตรการออกแบบนี้คืออะไร</p>
          <p className="text-gray-600 mb-4">หลักสูตรนี้เป็นการเข้าสู่การออกแบบดิจิทัล ทั้งในแนวคิดและในทางปฏิบัติ เราเชื่อว่าทุกคนสามารถเรียนรู้วิธีการออกแบบได้ และการเข้าถึงการศึกษาด้านการออกแบบควรไม่มีค่าใช้จ่ายและพร้อมให้ใช้งาน ยิ่งมีคนที่สามารถออกแบบและสร้างสิ่งที่พวกเขาจินตนาการได้มากเท่าไร โลกก็จะยิ่งดีขึ้นเท่านั้น</p>
          <p className="text-gray-600 mb-4">มีอุปสรรคหลายประการในการเป็นนักออกแบบ ตั้งแต่ต้นทุน — การซื้อซอฟต์แวร์การออกแบบและคอมพิวเตอร์ที่มีความสามารถเพียงพอในการใช้งาน — ไปจนถึงความรู้อาจมีราคาแพง เนื่องจากการออกแบบดิจิทัลเป็นสาขาใหม่ และมหาวิทยาลัยหลายแห่งยังไม่มีชั้นเรียนเฉพาะเจาะจง และหลักสูตรการออกแบบผลิตภัณฑ์ดิจิทัล</p>
          <p className="text-gray-600 mb-4">ดังนั้นเราจึงสร้างหลักสูตรและชุมชนฟรีสำหรับการเรียนรู้พื้นฐานการออกแบบเพื่อเตรียมคุณให้พร้อมสำหรับการเข้าสู่หรือเติบโตในอาชีพการออกแบบดิจิทัล</p>
          <p className="text-gray-600 mb-4">หลักสูตรนี้เน้นไปที่การออกแบบดิจิทัล: การสร้างแอป เว็บไซต์ และรูปภาพดิจิทัล เราจะเน้นไปที่สองส่วนแรกโดยเฉพาะ นั่นหมายความว่าเราไม่ได้มุ่งเน้นไปที่การออกแบบสิ่งพิมพ์หรือการออกแบบอุตสาหกรรมเช่นกัน โดยไม่คำนึงถึงพื้นฐานเดียวกัน—แนวคิดและทักษะทางเทคนิค—ที่คุณจะได้เรียนรู้เพื่อนำไปใช้กับการออกแบบหลายรูปแบบ ตัวอย่างเช่น ระบบกริดที่แข็งแกร่งซึ่งสร้างขึ้นสำหรับเว็บ สามารถแปลเป็นการออกแบบสิ่งพิมพ์ได้อย่างง่ายดาย และในทางกลับกัน บ่อยครั้งที่ความแตกต่างพื้นฐานระหว่างสาขาวิชาการออกแบบเป็นคำศัพท์สำคัญบางประการและแอปพลิเคชันซอฟต์แวร์ที่ใช้ในอุตสาหกรรมนั้น</p>
          <p className="text-gray-600 mb-4">ในหลักสูตรนี้ คุณจะได้เรียนรู้แต่ละขั้นตอนในการออกแบบและสร้างผลิตภัณฑ์ดิจิทัล ตั้งแต่การระบุกลุ่มเป้าหมายสำหรับผลิตภัณฑ์ของคุณ การทำวิจัย การพิจารณาจริยธรรมและการเข้าถึง ไปจนถึงการออกแบบไอคอน ระบบกริด จานสี องค์ประกอบ และอื่นๆ มีบทเรียนให้เรียนรู้เกี่ยวกับแนวคิดหลักและแบบฝึกหัดการออกแบบเพื่อให้คุณฝึกฝนทักษะที่คุณเรียนรู้ หลักสูตรนี้เน้นการเรียนรู้ด้วยตนเอง อย่างไรก็ตาม เราขอแนะนำว่าอย่าพยายามจัดให้อยู่ในสุดสัปดาห์เดียว คุณสามารถพิจารณาแบบฝึกหัดการออกแบบตลอดทั้งเหตุการณ์สำคัญได้ ให้เวลาตัวเองมากพอที่จะเข้าใจแต่ละแนวคิด</p>
          <p className="text-2xl font-semibold text-gray-600 mb-4">หลักสูตรนี้มีลักษณะอย่างไร?</p>
          <ul class="list-disc p-5">
          <li>บทเรียน สิ่งเหล่านี้ขึ้นอยู่กับแนวคิดหลักในการออกแบบ โดยแบ่งออกเป็นการออกแบบ UI การสร้างต้นแบบ ระบบการออกแบบ การทำโครงร่าง และการสร้างต้นแบบ คุณยังสามารถเรียนรู้เพิ่มเติมเกี่ยวกับการระดมความคิดแบบเต็มรูปแบบเพื่อกระบวนการออกแบบโดยดูที่แนวคิดการระดมความคิดและการสร้างไดอะแกรม</li>
          <li>Figma Community. ชุมชนนักออกแบบและลูกค้า Figma ระดับโลกแห่งนี้เป็นอีกแหล่งข้อมูลหนึ่งสำหรับคุณ</li>
          </ul>
          <p className="text-gray-600 mb-4">และนั่นก็คือ เรามีหลักการสำคัญห้าประการที่ Figma: สร้างชุมชน วิ่งไปกับมัน รักงานฝีมือของคุณ เติบโตไปพร้อมกับคุณ และเล่น! สิ่งที่ฉันชอบเป็นการส่วนตัวคือ Play! เป็นแกนหลักของปรัชญาของ Figma และเราเชื่อว่าสิ่งนี้เป็นพื้นฐานของการออกแบบด้วยตัวมันเอง เช่นเดียวกับการออกแบบที่ยอดเยี่ยมอื่นๆ พวกมันจะดีขึ้นเมื่อเวลาผ่านไปผ่านการทำซ้ำ ศูนย์การศึกษาแห่งนี้ก็ไม่ต่างกัน ไม่ต้องกังวล คุณจะไม่ต้องกลับมาอ่านเนื้อหาทั้งหมดนี้ซ้ำบ่อยๆ เราปรารถนาที่จะปรับปรุงเนื้อหานี้เมื่อเราพบการพิมพ์ผิด ข้อผิดพลาดด้านไวยากรณ์ หรือแม้แต่ข้อมูลที่ไม่ถูกต้อง แต่อุตสาหกรรมนี้มีการเปลี่ยนแปลงอย่างรวดเร็วและเปลี่ยนแปลงอยู่ตลอดเวลา ดังนั้น เราจะพยายามอย่างดีที่สุดเพื่อติดตามเนื้อหาดังกล่าวด้วยแนวคิดและตัวอย่างที่เกี่ยวข้องอย่างสม่ำเสมอ</p>

        </div>
      
        
        
       
      
        
        
       
      
    </div>
  );
}



